sasan-safaei/ICA_TM_V2/TM_V2/Source/STM32ProgFunc/STM32G030Class.cpp
#include "Stm32G030Class.h"

#include <cerrno>
#include <chrono>
#include <cstdio>
#include <cstdlib>
#include <iostream>
#include <string>
#include <cstring>
#include <fcntl.h>
#include <fstream>
#include <sstream>
#include <iomanip>
#include <limits>
#include <limits.h>
#include <termios.h>
#include <sys/select.h>
#include <sys/stat.h>
#include <unistd.h>





// Constructor with default configuration
STM32G030F6_Class::STM32G030F6_Class()
	: interfaceCfg_("interface/raspberrypi2-native.cfg"),
	  targetCfg_("target/stm32g0x.cfg"),
	  //interfaceCfg_("./OpenOCD_CFG/raspberrypi2-native.cfg"),//("interface/raspberrypi2-native.cfg"),
	  //targetCfg_("./OpenOCD_CFG/stm32g0x.cfg"),//("target/stm32g0x.cfg"),	   
	  flashAddress_(0x08000000),
	  adapterKhz_(200),
	  uartPort_("/dev/ttyAMA1"),
	  uartBaud_(9600),
	  uartTimeoutMs_(200),
	  lastUartResponse_("") {
}

// Constructor with custom configuration
STM32G030F6_Class::STM32G030F6_Class(const std::string& interfaceCfg,
									 const std::string& targetCfg,
									 uint32_t flashAddress,
									 int adapterKhz,
									 const std::string& uartPort,
									 int uartBaud)
	: interfaceCfg_(interfaceCfg),
	  targetCfg_(targetCfg),
	  flashAddress_(flashAddress),
	  adapterKhz_(adapterKhz),
	  uartPort_(uartPort),
	  uartBaud_(uartBaud),
	  uartTimeoutMs_(200),
	  lastUartResponse_("") {
}

// Flash programming
bool STM32G030F6_Class::Flash(const std::string& binPath) {
	if (!FileExists(binPath)) {
		fprintf(stderr, "Flash: file not found: %s\n", binPath.c_str());
		return false;
	}
	if (!CommandAvailable("openocd")) {
		fprintf(stderr, "Flash: openocd not found in PATH\n");
		return false;
	}

	const std::string absBinPath = ToAbsolutePath(binPath);

	// Because the board uses a MOSFET that inverts the reset signal (gate on GPIO 26,
	// source to target reset on GPIO 24), assert the gate here and keep it asserted
	// for the whole OpenOCD operation so the target is held in reset while we connect
	// (connect-under-reset). Release the gate after OpenOCD finishes. This requires
	// running as root so sysfs GPIO is writable.

	/*std::string gpioPath = std::string("/sys/class/gpio/gpio") + std::to_string(kRpiNresetGpio);
	std::system((std::string("echo ") + std::to_string(kRpiNresetGpio) + " > /sys/class/gpio/export 2>/dev/null || true").c_str());
	std::system((std::string("echo out > ") + gpioPath + "/direction 2>/dev/null || true").c_str());
	// Assert gate (drive high) to hold reset (MOSFET inverts this)
	std::system((std::string("echo 0 > ") + gpioPath + "/value 2>/dev/null || true").c_str());
	*/	
	std::ostringstream cmd;	
	cmd << "openocd";
	AppendInterfaceConfig(cmd, interfaceCfg_);
	cmd << " -c \"set WORKAREASIZE 0x" << std::hex << kRpiWorkAreaSize << "\""
		<< " -f " << targetCfg_
		<< " -c \"adapter speed " << std::dec << adapterKhz_ << "\""
		<< " -c \"stm32g0x.cpu configure -work-area-phys 0x" << std::hex << kRpiWorkAreaBase
		<< " -work-area-size 0x" << std::hex << kRpiWorkAreaSize << " -work-area-backup 0\""
        
		<< " -c \"init\""
		<< " -c \"reset halt\""
		<< " -c \"flash write_image erase " << absBinPath << " 0x" << std::hex << flashAddress_ << " bin\""
		<< " -c \"reset run\""
		<< " -c \"shutdown\"";

	const int result = std::system(cmd.str().c_str());

	// Release reset gate after OpenOCD finishes
	//std::system((std::string("echo 0 > ") + gpioPath + "/value 2>/dev/null || true").c_str());

	if (result != 0) {
		fprintf(stderr, "Flash: openocd failed (%d)\n", result);
		return false;
	}

	return true;
}

// Erase flash memory
bool STM32G030F6_Class::Clear() {
	if (!CommandAvailable("openocd")) {
		fprintf(stderr, "Clear: openocd not found in PATH\n");
		return false;
	}

	std::ostringstream cmd;
	cmd << "openocd";
	AppendInterfaceConfig(cmd, interfaceCfg_);
	cmd << " -c \"set WORKAREASIZE 0x" << std::hex << kRpiWorkAreaSize << "\""
		<< " -f " << targetCfg_
		<< " -c \"adapter speed " << std::dec << adapterKhz_ << "\""
		<< " -c \"init\""
		<< " -c \"reset halt\""
		<< " -c \"stm32g0x mass_erase 0\""
		<< " -c \"reset run\""
		<< " -c \"shutdown\"";

	const int result = std::system(cmd.str().c_str());
	if (result != 0) {
		fprintf(stderr, "Clear: openocd failed (%d)\n", result);
		return false;
	}

	return true;
}

// Verify/compare flash content
FlashCompareResult STM32G030F6_Class::Verify(const std::string& binPath) {
	if (!FileExists(binPath)) {
		fprintf(stderr, "Verify: file not found: %s\n", binPath.c_str());
		return FlashCompareResult::Error;
	}
	if (!CommandAvailable("openocd")) {
		fprintf(stderr, "Verify: openocd not found in PATH\n");
		return FlashCompareResult::Error;
	}

	size_t binSize = 0;
	if (!FileSize(binPath, binSize) || binSize == 0) {
		fprintf(stderr, "Verify: invalid file size\n");
		return FlashCompareResult::Error;
	}

	char tmpTemplate[] = "/tmp/ica2506_dump_XXXXXX";
	const int fd = mkstemp(tmpTemplate);
	if (fd < 0) {
		fprintf(stderr, "Verify: failed to create temp file\n");
		return FlashCompareResult::Error;
	}
	close(fd);
	const std::string dumpPath = tmpTemplate;

	std::string output;
	bool ok = false;
	std::string lastOutput;
	const int originalAdapterKhz = adapterKhz_;
	const int fallbackSpeeds[] = {originalAdapterKhz};// {originalAdapterKhz,50, 25, 20, 5};

	for (int speed : fallbackSpeeds) {
		if (speed <= 0 || speed == adapterKhz_) {
			// Skip invalid and duplicate speed attempts.
			if (speed <= 0) {
				continue;
			}
		}
		adapterKhz_ = speed;

		for (int attempt = 0; attempt < 2; ++attempt) {
			output.clear();
			ok = DumpFlashImage(dumpPath, flashAddress_, binSize, output);
			if (ok) {
				break;
			}
			lastOutput = output;
			Reset();
			usleep(150000);
		}

		if (ok) {
			break;
		}
	}

	adapterKhz_ = originalAdapterKhz;
	if (!ok) {
		fprintf(stderr, "Verify: openocd dump failed\n");
		fprintf(stderr, "%s\n", lastOutput.empty() ? output.c_str() : lastOutput.c_str());
		std::remove(dumpPath.c_str());
		return FlashCompareResult::Error;
	}

	// Pass binSize to compare so it ignores padding bytes OpenOCD may have added
	FlashCompareResult result = CompareBinToDump(binPath, dumpPath, binSize);
	std::remove(dumpPath.c_str());
	return result;
}

// Read and display option bytes (boot mode configuration)
bool STM32G030F6_Class::ReadAll_ob() {
	if (!CommandAvailable("openocd")) {
		fprintf(stderr, "ReadAll_ob: openocd not found in PATH\n");
		return false;
	}

	const std::string gpioBase = "/sys/class/gpio";
	const std::string gpioPath = gpioBase + "/gpio" + std::to_string(kRpiNresetGpio);
	std::system(("echo " + std::to_string(kRpiNresetGpio) + " > " + gpioBase + "/export 2>/dev/null || true").c_str());
	std::system(("echo out > " + gpioPath + "/direction 2>/dev/null || true").c_str());
	std::system(("echo 1 > " + gpioPath + "/value 2>/dev/null || true").c_str()); // HIGH → MOSFET ON → NRST LOW
	
