sasan-safaei/ICA_TM_V2/TM_V2/Source/STM32ProgFunc/STM32G030Class.cpp
	std::ostringstream cmd;
	cmd << "openocd";
	AppendInterfaceConfig(cmd, interfaceCfg_);
	cmd << " -c \"set WORKAREASIZE 0x" << std::hex << kRpiWorkAreaSize << "\""
		<< " -f " << targetCfg_
		<< " -c \"reset_config none\""   // We own the reset pin; OpenOCD must not touch it
		<< " -c \"adapter speed " << std::dec << adapterKhz_ << "\""
		<< " -c \"init\""
		<< " -c \"mww 0xe000edfc 0x01000001\""  // DEMCR: TRCENA | VC_CORERESET
		<< " -c \"exec sh -c {echo 0 > /sys/class/gpio/gpio" << kRpiNresetGpio << "/value}\""
		<< " -c \"wait_halt 2000\""      // Wait up to 2 s for core to halt at reset vector		
		<< " -c \"mww 0xe000edfc 0x01000000\""  // Clear VC_CORERESET (keep TRCENA)
		//<< " -c \"reset halt\""
		<< " -c \"mdw 0x" << std::hex << kOptionBytesAddr << " " << std::dec << kOptionBytesWords << "\""
		<< " -c \"shutdown\"";

	std::string output;
	const int status = RunCommandCapture(cmd.str() + " 2>&1", output);

	std::system(("echo 1 > /sys/class/gpio/gpio" + std::to_string(kRpiNresetGpio) + "/value 2>/dev/null || true").c_str()); 
	usleep(100000); // 100 ms delay to ensure the target sees the reset pulse
	std::system(("echo 0 > /sys/class/gpio/gpio" + std::to_string(kRpiNresetGpio) + "/value 2>/dev/null || true").c_str()); 
	usleep(50000); // 100 ms delay to ensure the target sees the reset pulse	


	std::vector<std::pair<uint32_t, uint32_t>> words;
	std::istringstream iss(output);
	std::string line;
	while (std::getline(iss, line)) {
		uint32_t addr = 0;
		std::vector<uint32_t> values;
		if (!ParseMdwLine(line, addr, values)) {
			continue;
		}
		if (addr < kOptionBytesAddr ||
			addr >= kOptionBytesAddr + static_cast<uint32_t>(kOptionBytesWords * 4)) {
			continue;
		}
		for (size_t i = 0; i < values.size(); ++i) {
			const uint32_t word_addr = addr + static_cast<uint32_t>(i * 4);
			words.emplace_back(word_addr, values[i]);
		}
	}

	if (words.empty()) {
		printf("No option bytes found in OpenOCD output.\n");
		printf("Raw OpenOCD output:\n%s\n", output.c_str());
		return false;
	}

	if (status != 0) {
		fprintf(stderr, "ReadAll_ob: openocd exited with status %d\n", status);
	}

	PrintOptionBytesDecode(words);

	return true;
}

// Read option bytes and return OPTR value
bool STM32G030F6_Class::ReadOptionBytes(uint32_t& optrValue) {
	if (!CommandAvailable("openocd")) {
		fprintf(stderr, "ReadOptionBytes: openocd not found in PATH\n");
		return false;
	}

	std::ostringstream cmd;
	cmd << "openocd";
	AppendInterfaceConfig(cmd, interfaceCfg_);
	cmd << " -c \"set WORKAREASIZE 0x" << std::hex << kRpiWorkAreaSize << "\""
		<< " -f " << targetCfg_
		<< " -c \"adapter speed " << std::dec << adapterKhz_ << "\""
		<< " -c \"init\""
		<< " -c \"reset halt\""
		<< " -c \"mdw 0x" << std::hex << kOptionBytesAddr << " 1\""
		<< " -c \"shutdown\"";

	std::string output;
	const int status = RunCommandCapture(cmd.str() + " 2>&1", output);

	// Parse the output to extract OPTR value
	std::istringstream iss(output);
	std::string line;
	while (std::getline(iss, line)) {
		uint32_t addr = 0;
		std::vector<uint32_t> values;
		if (ParseMdwLine(line, addr, values) && !values.empty()) {
			if (addr == kOptionBytesAddr) {
				optrValue = values[0];
				return true;
			}
		}
	}

	fprintf(stderr, "ReadOptionBytes: failed to read OPTR\n");
	return false;
}

// Program option bytes with new OPTR value
bool STM32G030F6_Class::WriteOptionBytes(uint32_t optrValue) {
	if (!CommandAvailable("openocd")) {
		fprintf(stderr, "WriteOptionBytes: openocd not found in PATH\n");
		return false;
	}

	// Read current value first for safety
	uint32_t currentOptr = 0;
	if (!ReadOptionBytes(currentOptr)) {
		fprintf(stderr, "WriteOptionBytes: failed to read current option bytes\n");
		return false;
	}

	printf("Current OPTR: 0x%08X\n", currentOptr);
	printf("New OPTR:     0x%08X\n", optrValue);

	// Safety check: Warn if RDP is being changed
	const uint8_t currentRdp = static_cast<uint8_t>(currentOptr & 0xFF);
	const uint8_t newRdp = static_cast<uint8_t>(optrValue & 0xFF);
	if (currentRdp != newRdp) {
		if (newRdp == 0xCC) {
			fprintf(stderr, "WriteOptionBytes: DANGEROUS! RDP Level 2 (0xCC) is PERMANENT!\n");
			fprintf(stderr, "WriteOptionBytes: This will PERMANENTLY LOCK the chip!\n");
			fprintf(stderr, "WriteOptionBytes: Refusing to proceed.\n");
			return false;
		}
		printf("WARNING: RDP level changing from 0x%02X to 0x%02X\n", currentRdp, newRdp);
	}

	// Program option bytes using OpenOCD stm32g0x option_write command
	std::ostringstream cmd;
	cmd << "openocd";
	AppendInterfaceConfig(cmd, interfaceCfg_);
	cmd << " -c \"set WORKAREASIZE 0x" << std::hex << kRpiWorkAreaSize << "\""
		<< " -f " << targetCfg_
		<< " -c \"adapter speed " << std::dec << adapterKhz_ << "\""
		<< " -c \"init\""
		<< " -c \"reset halt\""
		<< " -c \"sleep 50\""
		// Use OpenOCD's built-in command to write option bytes
		// Format: stm32g0x option_write bank_id offset value
		<< " -c \"stm32g0x option_write 0 0x20 0x" << std::hex << optrValue << "\""
		<< " -c \"sleep 200\""
		// Reload option bytes
		<< " -c \"stm32g0x option_load 0\""
		<< " -c \"sleep 200\""
		// Reset and verify
		<< " -c \"reset halt\""
		<< " -c \"sleep 50\""
		<< " -c \"mdw 0x40022020\""
		<< " -c \"reset run\""
		<< " -c \"shutdown\"";

	printf("Programming option bytes...\n");
	const int result = std::system(cmd.str().c_str());
	if (result != 0) {
		fprintf(stderr, "WriteOptionBytes: openocd failed (%d)\n", result);
		return false;
	}

	// Give the chip time to reset and reload option bytes
	sleep(1);

	// Verify the write
	uint32_t verifyOptr = 0;
	if (ReadOptionBytes(verifyOptr)) {
		if (verifyOptr == optrValue) {
			printf("Option bytes programmed successfully!\n");
			return true;
		} else {
			fprintf(stderr, "WriteOptionBytes: verification failed (read 0x%08X, expected 0x%08X)\n",
					verifyOptr, optrValue);
			return false;
		}
	}

	return true;
}

// Helper: Build OPTR value from individual bits
uint32_t STM32G030F6_Class::BuildOPTR(uint8_t rdp, uint8_t bor_lev, bool nrst_stop, bool nrst_stdby,
                                       bool nrst_shdw, bool iwdg_sw, bool iwdg_stop, bool iwdg_stdby,
                                       bool wwdg_sw, bool sram_parity, bool nboot0, bool nboot1,
                                       bool nboot_sel, bool boot_lock) {
	uint32_t optr = 0;
	optr |= static_cast<uint32_t>(rdp);
	optr |= static_cast<uint32_t>(bor_lev & 0x7) << 8;
	if (nrst_stop)   optr |= (1U << 12);
	if (nrst_stdby)  optr |= (1U << 13);
	if (nrst_shdw)   optr |= (1U << 14);
	if (iwdg_sw)     optr |= (1U << 16);
	if (iwdg_stop)   optr |= (1U << 17);
	if (iwdg_stdby)  optr |= (1U << 18);
	if (wwdg_sw)     optr |= (1U << 19);
	if (sram_parity) optr |= (1U << 21);
	if (nboot0)      optr |= (1U << 24);
	if (nboot1)      optr |= (1U << 25);
	if (nboot_sel)   optr |= (1U << 26);
	if (boot_lock)   optr |= (1U << 27);
	return optr;
}

