sasan-safaei/ICA_TM_V2/TM_V2/Source/STM32ProgFunc/STM32G030Class.cpp
// Reset the microcontroller
bool STM32G030F6_Class::Reset() {
	std::system((std::string("echo 1 > /sys/class/gpio/gpio") + std::to_string(kRpiNresetGpio) + "/value").c_str());// 2>/dev/null || true").c_str());
	usleep(100000);
	std::system((std::string("echo 0 > /sys/class/gpio/gpio") + std::to_string(kRpiNresetGpio) + "/value").c_str());// 2>/dev/null || true").c_str());
	usleep(50000);
	return true;

	if (!CommandAvailable("openocd")) {
		fprintf(stderr, "Reset: openocd not found in PATH\n");
		return false;
	}

	// If using the Raspberry Pi bcm2835gpio interface and the NRST line
	// is driven through an inverting MOSFET, pulse the gate GPIO here
	// so the target leaves an unexpected held-reset state before OpenOCD
	// runs. This uses sysfs and requires the program to run with sudo.
	if (IsRaspberryPiInterface(interfaceCfg_)) {
		//std::system((std::string("echo ") + std::to_string(kRpiNresetGpio) + " > /sys/class/gpio/export 2>/dev/null || true").c_str());
		//std::system((std::string("echo out > /sys/class/gpio/gpio") + std::to_string(kRpiNresetGpio) + "/direction 2>/dev/null || true").c_str());
		std::system((std::string("echo 1 > /sys/class/gpio/gpio") + std::to_string(kRpiNresetGpio) + "/value").c_str());// 2>/dev/null || true").c_str());
		usleep(100000);
		std::system((std::string("echo 0 > /sys/class/gpio/gpio") + std::to_string(kRpiNresetGpio) + "/value").c_str());// 2>/dev/null || true").c_str());
		usleep(50000);
	}

	std::ostringstream cmd;
	cmd << "openocd";
	AppendInterfaceConfig(cmd, interfaceCfg_);
	cmd << " -c \"set WORKAREASIZE 0x" << std::hex << kRpiWorkAreaSize << "\""
		<< " -f " << targetCfg_
		<< " -c \"adapter speed " << std::dec << adapterKhz_ << "\""
		<< " -c \"init\""
		<< " -c \"reset run\""
		<< " -c \"shutdown\"";

	const int result = std::system(cmd.str().c_str());
	if (result != 0) {
		fprintf(stderr, "Reset: openocd failed (%d)\n", result);
		return false;
	}

	return true;
}

// Test SWD interface connection
bool STM32G030F6_Class::TestInterface() {
	if (!CommandAvailable("openocd")) {
		fprintf(stderr, "TestInterface: openocd not found in PATH\n");
		return false;
	}

	printf("==========================================\n");
	printf("SWD Interface Connection Test\n");
	printf("==========================================\n");
	printf("Configuration:\n");
	printf("  Interface: %s\n", interfaceCfg_.c_str());
	printf("  Target:    %s\n", targetCfg_.c_str());
	printf("  Speed:     %d kHz\n", adapterKhz_);
	printf("  GPIO pins: SWCLK=%d, SWDIO=%d\n", kRpiSwclkGpio, kRpiSwdioGpio);
	printf("==========================================\n\n");

	// Build OpenOCD command to test connection
	std::ostringstream cmd;
	cmd << "openocd";
	AppendInterfaceConfig(cmd, interfaceCfg_);
	cmd << " -c \"set WORKAREASIZE 0x" << std::hex << kRpiWorkAreaSize << "\""
		<< " -f " << targetCfg_
		<< " -c \"adapter speed " << std::dec << adapterKhz_ << "\""
		<< " -c \"init\""
		<< " -c \"shutdown\" 2>&1";

	// Run command and capture output
	std::string output;
	printf("Testing SWD connection...\n\n");
	const int status = RunCommandCapture(cmd.str(), output);

	// Display raw output
	printf("OpenOCD Output:\n");
	printf("----------------------------------------\n");
	printf("%s\n", output.c_str());
	printf("----------------------------------------\n\n");

	// Parse output for key indicators
	bool hasDeadbeef = (output.find("0xdeadbeef") != std::string::npos);
	bool hasValidDpidr = (output.find("SWD DPIDR") != std::string::npos) && !hasDeadbeef;
	bool hasError = (output.find("Error:") != std::string::npos);
	
	// Extract DPIDR value if present
	std::string dpidrValue = "Not found";
	size_t dpidrPos = output.find("SWD DPIDR");
	if (dpidrPos != std::string::npos) {
		size_t valueStart = output.find("0x", dpidrPos);
		if (valueStart != std::string::npos) {
			size_t valueEnd = output.find_first_of(" \t\n\r", valueStart);
			if (valueEnd != std::string::npos) {
				dpidrValue = output.substr(valueStart, valueEnd - valueStart);
			}
		}
	}

	// Print diagnostic results
	printf("Diagnostic Results:\n");
	printf("----------------------------------------\n");
	printf("DPIDR Value:       %s\n", dpidrValue.c_str());
	
	if (hasDeadbeef) {
		printf("Connection Status: FAILED (0xdeadbeef)\n");
		printf("\nProbable Causes:\n");
		printf("  1. Loose or disconnected wires (SWDIO/GPIO %d or SWCLK/GPIO %d)\n", 
		       kRpiSwdioGpio, kRpiSwclkGpio);
		printf("  2. Target chip not powered (check VDD = 3.3V)\n");
		printf("  3. Ground not connected between debugger and target\n");
		printf("  4. Wrong GPIO pin configuration\n");
		printf("  5. Faulty target chip\n");
		printf("\nTroubleshooting Steps:\n");
		printf("  1. Check physical connections (SWDIO, SWCLK, GND, VDD)\n");
		printf("  2. Verify target power (measure 3.3V on VDD pin)\n");
		printf("  3. Try lower speed: use --testInterface interface target 10\n");
		printf("  4. Check for shorts or damaged wires\n");
		printf("  5. Verify GPIO pins are not used by other processes\n");
	} else if (hasValidDpidr) {
		printf("Connection Status: SUCCESS\n");
		printf("\nThe SWD interface is working correctly.\n");
		printf("You can proceed with flash operations.\n");
	} else if (hasError) {
		printf("Connection Status: ERROR\n");
		printf("\nOpenOCD reported errors. Check the output above.\n");
	} else {
		printf("Connection Status: UNKNOWN\n");
		printf("\nCould not determine connection status from output.\n");
	}
	printf("==========================================\n");

	return hasValidDpidr && !hasDeadbeef;
}

// UART transmit
bool STM32G030F6_Class::UartTx(const std::string& hexStream) {
	std::vector<uint8_t> tx;
	if (!ParseHexStream(hexStream, tx)) {
		fprintf(stderr, "UartTx: invalid hex stream\n");
		return false;
	}

	const int fd = open(uartPort_.c_str(), O_RDWR | O_NOCTTY | O_SYNC);
	if (fd < 0) {
		fprintf(stderr, "UartTx: open failed: %s\n", strerror(errno));
		return false;
	}

	if (!ConfigurePort(fd, uartBaud_)) {
		fprintf(stderr, "UartTx: configure failed\n");
		close(fd);
		return false;
	}

	if (!tx.empty()) {
		const ssize_t written = write(fd, tx.data(), tx.size());
		if (written < 0 || static_cast<size_t>(written) != tx.size()) {
			fprintf(stderr, "UartTx: write failed\n");
			close(fd);
			return false;
		}
	}

	std::vector<uint8_t> rx;
	rx.reserve(1024);

	const auto start = std::chrono::steady_clock::now();
	auto last_data = start;

	while (true) {
		const auto now = std::chrono::steady_clock::now();
		const auto idle_elapsed = std::chrono::duration_cast<std::chrono::milliseconds>(now - last_data).count();
		if (!rx.empty() && idle_elapsed >= uartTimeoutMs_) {
			break;
		}

		struct timeval tv;
		tv.tv_sec = 0;
		tv.tv_usec = 20000;
		fd_set rfds;
		FD_ZERO(&rfds);
		FD_SET(fd, &rfds);

		const int ready = select(fd + 1, &rfds, nullptr, nullptr, &tv);
		if (ready > 0 && FD_ISSET(fd, &rfds)) {
			uint8_t buf[256];
			const ssize_t n = read(fd, buf, sizeof(buf));
			if (n > 0) {
				rx.insert(rx.end(), buf, buf + n);
				last_data = std::chrono::steady_clock::now();
			}
		}
	}

