sasan-safaei/ICA_TM_V2/TM_V2/Source/STM32ProgFunc/STM32G030Class.cpp
	close(fd);
	lastUartResponse_ = BytesToHex(rx);
	return true;
}

// UART receive (get last response)
std::string STM32G030F6_Class::UartRx() const {
	return lastUartResponse_;
}

// UART transmit and receive
bool STM32G030F6_Class::FrameProcess(const std::string& hexStream, std::string& responseHex) {
	responseHex.clear();
	std::vector<uint8_t> tx;
	if (!ParseHexStream(hexStream, tx)) {
		fprintf(stderr, "FrameProcess: invalid hex stream\n");
		return false;
	}

	const int fd = open(uartPort_.c_str(), O_RDWR | O_NOCTTY | O_SYNC);
	if (fd < 0) {
		fprintf(stderr, "FrameProcess: open failed: %s\n", strerror(errno));
		return false;
	}

	if (!ConfigurePort(fd, uartBaud_)) {
		fprintf(stderr, "FrameProcess: configure failed\n");
		close(fd);
		return false;
	}

	// Clear any pending input on the serial port before sending the command
	// to ensure we only read the response to the command we are about to send.
	tcflush(fd, TCIFLUSH);

	if (!tx.empty()) {
		const ssize_t written = write(fd, tx.data(), tx.size());
		if (written < 0 || static_cast<size_t>(written) != tx.size()) {
			fprintf(stderr, "FrameProcess: write failed\n");
			close(fd);
			return false;
		}
	}

	std::vector<uint8_t> rx;
	rx.reserve(1024);

	const auto start = std::chrono::steady_clock::now();
	auto last_data = start;

	while (true) {
		const auto now = std::chrono::steady_clock::now();
		const auto idle_elapsed = std::chrono::duration_cast<std::chrono::milliseconds>(now - last_data).count();
		if (!rx.empty() && idle_elapsed >= uartTimeoutMs_) {
			break;
		}

		struct timeval tv;
		tv.tv_sec = 0;
		tv.tv_usec = 20000;
		fd_set rfds;
		FD_ZERO(&rfds);
		FD_SET(fd, &rfds);

		const int ready = select(fd + 1, &rfds, nullptr, nullptr, &tv);
		if (ready > 0 && FD_ISSET(fd, &rfds)) {
			uint8_t buf[256];
			const ssize_t n = read(fd, buf, sizeof(buf));
			if (n > 0) {
				rx.insert(rx.end(), buf, buf + n);
				last_data = std::chrono::steady_clock::now();
			}
		}
	}

	close(fd);
	responseHex = BytesToHex(rx);
	lastUartResponse_ = responseHex;
	return true;
}

// UART transmit and receive with custom timeout
bool STM32G030F6_Class::FrameProcess(const std::string& hexStream, std::string& responseHex, int idleTimeoutMs) {
	responseHex.clear();
	std::vector<uint8_t> tx;
	if (!ParseHexStream(hexStream, tx)) {
		fprintf(stderr, "FrameProcess: invalid hex stream\n");
		return false;
	}

	const int fd = open(uartPort_.c_str(), O_RDWR | O_NOCTTY | O_SYNC);
	if (fd < 0) {
		fprintf(stderr, "FrameProcess: open failed: %s\n", strerror(errno));
		return false;
	}

	if (!ConfigurePort(fd, uartBaud_)) {
		fprintf(stderr, "FrameProcess: configure failed\n");
		close(fd);
		return false;
	}
	// Clear any pending input on the serial port before sending the command
	// to ensure we only read the response to the command we are about to send.
	tcflush(fd, TCIFLUSH);

	if (!tx.empty()) {
		const ssize_t written = write(fd, tx.data(), tx.size());
		if (written < 0 || static_cast<size_t>(written) != tx.size()) {
			fprintf(stderr, "FrameProcess: write failed\n");
			close(fd);
			return false;
		}
	}

	std::vector<uint8_t> rx;
	rx.reserve(1024);

	const auto start = std::chrono::steady_clock::now();
	auto last_data = start;

	while (true) {
		const auto now = std::chrono::steady_clock::now();
		const auto idle_elapsed = std::chrono::duration_cast<std::chrono::milliseconds>(now - last_data).count();
		if (idle_elapsed >= idleTimeoutMs){//(!rx.empty() && idle_elapsed >= idleTimeoutMs) {
			break;
		}

		struct timeval tv;
		tv.tv_sec = 0;
		tv.tv_usec = 20000;
		fd_set rfds;
		FD_ZERO(&rfds);
		FD_SET(fd, &rfds);

		const int ready = select(fd + 1, &rfds, nullptr, nullptr, &tv);
		if (ready > 0 && FD_ISSET(fd, &rfds)) {
			uint8_t buf[256];
			const ssize_t n = read(fd, buf, sizeof(buf));
			if (n > 0) {
				rx.insert(rx.end(), buf, buf + n);
				last_data = std::chrono::steady_clock::now();
			}
		}
	}

	close(fd);
	responseHex = BytesToHex(rx);
	lastUartResponse_ = responseHex;
	return true;
}

// ============================================================================
// Private Helper Methods - Flash/SWD
// ============================================================================

bool STM32G030F6_Class::FileExists(const std::string& path) {
struct stat st;
return stat(path.c_str(), &st) == 0 && S_ISREG(st.st_mode);
}

bool STM32G030F6_Class::FileSize(const std::string& path, size_t& size) {
struct stat st;
if (stat(path.c_str(), &st) != 0 || !S_ISREG(st.st_mode)) {
return false;
}
if (st.st_size < 0) {
return false;
}
size = static_cast<size_t>(st.st_size);
return true;
}

std::string STM32G030F6_Class::ToAbsolutePath(const std::string& path) {
char resolved[PATH_MAX];
if (realpath(path.c_str(), resolved)) {
return std::string(resolved);
}
return path;
}

bool STM32G030F6_Class::CommandAvailable(const std::string& command) {
std::ostringstream oss;
oss << "command -v " << command << " >/dev/null 2>&1";
return std::system(oss.str().c_str()) == 0;
}

bool STM32G030F6_Class::IsRaspberryPiInterface(const std::string& interfaceCfg) {
return interfaceCfg.find("raspberrypi") != std::string::npos;
}

void STM32G030F6_Class::AppendInterfaceConfig(std::ostringstream& cmd, const std::string& interfaceCfg) {
if (IsRaspberryPiInterface(interfaceCfg)) {
	cmd << " -c \"adapter driver bcm2835gpio\""
		<< " -c \"transport select swd\""
		<< " -c \"bcm2835gpio_swd_nums " << kRpiSwclkGpio << " " << kRpiSwdioGpio << "\"";
} else {
cmd << " -f " << interfaceCfg;
}
}

int STM32G030F6_Class::RunCommandCapture(const std::string& cmd, std::string& output) {
FILE* pipe = popen(cmd.c_str(), "r");
if (!pipe) {
return -1;
}
char buffer[512];
output.clear();
while (fgets(buffer, sizeof(buffer), pipe)) {
output.append(buffer);
}
return pclose(pipe);
}

bool STM32G030F6_Class::ParseMdwLine(const std::string& line, uint32_t& addr, std::vector<uint32_t>& values) {
unsigned int a = 0;
if (std::sscanf(line.c_str(), "0x%x:", &a) != 1) {
return false;
}
addr = static_cast<uint32_t>(a);
values.clear();

