sasan-safaei/ICA_TM_V2/TM_V2/Source/STM32ProgFunc/STM32G030Class.cpp
const char* p = std::strchr(line.c_str(), ':');
if (!p) {
return false;
}
++p;
while (*p != '\0') {
while (*p == ' ' || *p == '\t') {
++p;
}
if (*p == '\0') {
break;
}
unsigned int v = 0;
int consumed = 0;
if (std::sscanf(p, "0x%x%n", &v, &consumed) == 1) {
values.push_back(static_cast<uint32_t>(v));
p += consumed;
continue;
}
if (std::sscanf(p, "%x%n", &v, &consumed) == 1) {
values.push_back(static_cast<uint32_t>(v));
p += consumed;
continue;
}
break;
}

return !values.empty();
}

void STM32G030F6_Class::PrintOptionBytesDecode(const std::vector<std::pair<uint32_t, uint32_t>>& words) {
if (words.empty()) {
printf("Option bytes: no data\n");
return;
}

printf("Option bytes raw (0x%08X..):\n", kOptionBytesAddr);
for (const auto& entry : words) {
printf("  0x%08X: 0x%08X\n", entry.first, entry.second);
}

const uint32_t optr = words.front().second;
const uint8_t rdp = static_cast<uint8_t>(optr & 0xFFu);
const uint8_t bor = static_cast<uint8_t>((optr >> 8) & 0x7u);
const bool n_rst_stop = (optr >> 12) & 0x1u;
const bool n_rst_stdby = (optr >> 13) & 0x1u;
const bool n_rst_shdw = (optr >> 14) & 0x1u;
const bool iwdg_sw = (optr >> 16) & 0x1u;
const bool iwdg_stop = (optr >> 17) & 0x1u;
const bool iwdg_stdby = (optr >> 18) & 0x1u;
const bool wwdg_sw = (optr >> 19) & 0x1u;
const bool sram_parity = (optr >> 21) & 0x1u;
const bool n_boot0 = (optr >> 24) & 0x1u;
const bool n_boot1 = (optr >> 25) & 0x1u;
const bool n_boot_sel = (optr >> 26) & 0x1u;
const bool boot_lock = (optr >> 27) & 0x1u;

printf("Decoded OPTR (0x%08X):\n", optr);
printf("  RDP: 0x%02X\n", rdp);
printf("  BOR_LEV: %u\n", bor);
printf("  nRST_STOP: %u\n", n_rst_stop ? 1 : 0);
printf("  nRST_STDBY: %u\n", n_rst_stdby ? 1 : 0);
printf("  nRST_SHDW: %u\n", n_rst_shdw ? 1 : 0);
printf("  IWDG_SW: %u\n", iwdg_sw ? 1 : 0);
printf("  IWDG_STOP: %u\n", iwdg_stop ? 1 : 0);
printf("  IWDG_STDBY: %u\n", iwdg_stdby ? 1 : 0);
printf("  WWDG_SW: %u\n", wwdg_sw ? 1 : 0);
printf("  SRAM_PARITY: %u\n", sram_parity ? 1 : 0);
printf("  nBOOT0: %u\n", n_boot0 ? 1 : 0);
printf("  nBOOT1: %u\n", n_boot1 ? 1 : 0);
printf("  nBOOT_SEL: %u\n", n_boot_sel ? 1 : 0);
printf("  BOOT_LOCK: %u\n", boot_lock ? 1 : 0);
}

bool STM32G030F6_Class::DumpFlashImage(const std::string& outPath, uint32_t address, size_t size, std::string& output) {
	// The flash controller is in reset while NRST is asserted, so AHB reads return
	// incorrect data if we hold reset for the entire dump. Instead:
	//   1. Assert NRST via sysfs so SWD pins are in default debug state on connect.
	//   2. After init, write DEMCR.VC_CORERESET so the core halts when it exits reset.
	//   3. Release NRST from within the OpenOCD session using exec+sh.
	//   4. wait_halt: core halts at the reset vector; flash controller is now live.
	//   5. dump_image reads correct flash data.
	const std::string gpioBase = "/sys/class/gpio";
	const std::string gpioPath = gpioBase + "/gpio" + std::to_string(kRpiNresetGpio);
	std::system(("echo " + std::to_string(kRpiNresetGpio) + " > " + gpioBase + "/export 2>/dev/null || true").c_str());
	std::system(("echo out > " + gpioPath + "/direction 2>/dev/null || true").c_str());
	std::system(("echo 1 > " + gpioPath + "/value 2>/dev/null || true").c_str()); // HIGH → MOSFET ON → NRST LOW

	std::system(("echo " + std::to_string(kRpiSwclkGpio) + " > " + gpioBase + "/export 2>/dev/null || true").c_str());
	std::system(("echo out > " + gpioPath + "/direction 2>/dev/null || true").c_str());
	std::system(("echo 1 > " + gpioPath + "/value 2>/dev/null || true").c_str()); // HIGH → MOSFET ON → NRST LOW
	std::system(("echo " + std::to_string(kRpiSwclkGpio) + " > " + gpioBase + "/unexport 2>/dev/null || true").c_str());
	
	
	std::ostringstream cmd;
	cmd << "openocd";
	AppendInterfaceConfig(cmd, interfaceCfg_);
	cmd << " -c \"set WORKAREASIZE 0x" << std::hex << kRpiWorkAreaSize << "\""
		<< " -f " << targetCfg_
		<< " -c \"reset_config none\""   // We own the reset pin; OpenOCD must not touch it
		<< " -c \"adapter speed " << std::dec << adapterKhz_ << "\""
		<< " -c \"init\""                // Connect while NRST is held LOW
		<< " -c \"mww 0xe000edfc 0x01000001\""  // DEMCR: TRCENA | VC_CORERESET
		// Release NRST from within OpenOCD so the core exits reset and halts immediately
		<< " -c \"exec sh -c {echo 0 > /sys/class/gpio/gpio" << kRpiNresetGpio << "/value}\""
		<< " -c \"wait_halt 2000\""      // Wait up to 2 s for core to halt at reset vector
		<< " -c \"mww 0xe000edfc 0x01000000\""  // Clear VC_CORERESET (keep TRCENA)
		<< " -c \"halt\""                // Ensure target is halted before flash reads
		<< " -c \"dump_image " << outPath << " 0x" << std::hex << address
		<< " 0x" << std::hex << size << "\""
		<< " -c \"shutdown\"";

	const int status = RunCommandCapture(cmd.str() + " 2>&1", output);

	// Ensure NRST is released even if exec inside OpenOCD failed
	std::system(("echo 0 > " + gpioPath + "/value 2>/dev/null || true").c_str());

	return status == 0;
}

FlashCompareResult STM32G030F6_Class::CompareBinToDump(const std::string& binPath, const std::string& dumpPath) {
	// Default: compare entire files
	return CompareBinToDump(binPath, dumpPath, std::numeric_limits<size_t>::max());
}

FlashCompareResult STM32G030F6_Class::CompareBinToDump(const std::string& binPath, const std::string& dumpPath, size_t maxBytes) {
std::ifstream binFile(binPath, std::ios::binary);
std::ifstream dumpFile(dumpPath, std::ios::binary);
if (!binFile.is_open() || !dumpFile.is_open()) {
return FlashCompareResult::Error;
}

const size_t kBufferSize = 4096;
std::vector<unsigned char> binBuf(kBufferSize);
std::vector<unsigned char> dumpBuf(kBufferSize);
bool all_ff = true;
bool all_same = true;
size_t bytesCompared = 0;

while (binFile && dumpFile && bytesCompared < maxBytes) {
	const size_t toRead = std::min(kBufferSize, maxBytes - bytesCompared);
	binFile.read(reinterpret_cast<char*>(binBuf.data()), toRead);
	dumpFile.read(reinterpret_cast<char*>(dumpBuf.data()), toRead);
	const std::streamsize binRead = binFile.gcount();
	const std::streamsize dumpRead = dumpFile.gcount();
	
	// At the end of file, if one is shorter than expected, it's an error
	if (binRead != dumpRead) {
		return FlashCompareResult::Error;
	}
	if (binRead <= 0) {
		break;
	}
	
