sasan-safaei/ICA_TM_V2/TM_V2/Source/STM32ProgFunc/STM32G030Class.cpp
	for (std::streamsize i = 0; i < binRead; ++i) {
		if (dumpBuf[static_cast<size_t>(i)] != 0xFFu) {
			all_ff = false;
		}
		if (dumpBuf[static_cast<size_t>(i)] != binBuf[static_cast<size_t>(i)]) {
			all_same = false;
		}
	}
	bytesCompared += static_cast<size_t>(binRead);
	if (!all_ff && !all_same) {
		break;
	}
}

if (all_ff) {
	return FlashCompareResult::Empty;
}
if (all_same) {
	return FlashCompareResult::Same;
}
return FlashCompareResult::Different;
}

// ============================================================================
// Private Helper Methods - UART
// ============================================================================

int STM32G030F6_Class::HexValue(char ch) {
if (ch >= '0' && ch <= '9') {
return ch - '0';
}
if (ch >= 'a' && ch <= 'f') {
return 10 + (ch - 'a');
}
if (ch >= 'A' && ch <= 'F') {
return 10 + (ch - 'A');
}
return -1;
}

bool STM32G030F6_Class::ParseHexStream(const std::string& hexStream, std::vector<uint8_t>& bytes) {
bytes.clear();
int high = -1;
for (size_t i = 0; i < hexStream.size(); ++i) {
const char ch = hexStream[i];
if (ch == ' ' || ch == '\t' || ch == '\n' || ch == '\r' || ch == ',') {
continue;
}
if (ch == '0' && (i + 1 < hexStream.size()) && (hexStream[i + 1] == 'x' || hexStream[i + 1] == 'X')) {
++i;
continue;
}
const int v = HexValue(ch);
if (v < 0) {
return false;
}
if (high < 0) {
high = v;
} else {
bytes.push_back(static_cast<uint8_t>((high << 4) | v));
high = -1;
}
}
return high < 0;
}

bool STM32G030F6_Class::GetBaudConstant(int baud, speed_t& out) {
switch (baud) {
case 9600: out = B9600; return true;
case 19200: out = B19200; return true;
case 38400: out = B38400; return true;
case 57600: out = B57600; return true;
case 115200: out = B115200; return true;
case 230400: out = B230400; return true;
case 460800: out = B460800; return true;
case 921600: out = B921600; return true;
default: return false;
}
}

bool STM32G030F6_Class::ConfigurePort(int fd, int baud) {
struct termios tty;
if (tcgetattr(fd, &tty) != 0) {
return false;
}

speed_t speed;
if (!GetBaudConstant(baud, speed)) {
return false;
}

cfsetispeed(&tty, speed);
cfsetospeed(&tty, speed);

tty.c_cflag = (tty.c_cflag & ~CSIZE) | CS8;
tty.c_cflag |= (CLOCAL | CREAD);
tty.c_cflag &= ~(PARENB | PARODD);
tty.c_cflag &= ~CSTOPB;
tty.c_cflag &= ~CRTSCTS;

tty.c_iflag &= ~(IGNBRK | BRKINT | PARMRK | ISTRIP | INLCR | IGNCR | ICRNL | IXON);
tty.c_oflag &= ~OPOST;
tty.c_lflag &= ~(ECHO | ECHONL | ICANON | ISIG | IEXTEN);

tty.c_cc[VMIN] = 0;
tty.c_cc[VTIME] = 0;

return tcsetattr(fd, TCSANOW, &tty) == 0;
}

std::string STM32G030F6_Class::BytesToHex(const std::vector<uint8_t>& bytes) {
std::ostringstream oss;
for (size_t i = 0; i < bytes.size(); ++i) {
if (i > 0) {
oss << ' ';
}
oss << std::uppercase << std::hex << std::setw(2) << std::setfill('0')
<< static_cast<int>(bytes[i]);
}
return oss.str();
}




namespace {
void PrintUsage(const char* prog) {
    std::cerr << "Usage: " << prog << " <firmware.bin> [interface.cfg] [target.cfg] [address_hex] [adapter_khz]\n";
    std::cerr << "       " << prog << " --ob [interface.cfg] [target.cfg] [adapter_khz]\n";
    std::cerr << "       " << prog << " --write-ob <OPTR_hex> [interface.cfg] [target.cfg] [adapter_khz]\n";
    std::cerr << "       " << prog << " --cmp <firmware.bin> [interface.cfg] [target.cfg] [address_hex] [adapter_khz]\n";
    std::cerr << "       " << prog << " --erase [interface.cfg] [target.cfg] [adapter_khz]\n";
    std::cerr << "       " << prog << " --reset [interface.cfg] [target.cfg] [adapter_khz]\n";
    std::cerr << "       " << prog << " --testInterface [interface.cfg] [target.cfg] [adapter_khz]\n";
    std::cerr << "       " << prog << " --uart  <file/str> <filePath/\"HEX BYTES\"> [port] [baud] [idle_ms]\n";
    std::cerr << "Example: " << prog << " firmware.bin interface/stlink.cfg target/stm32g0x.cfg 0x08000000 1000\n";
    std::cerr << "Example: " << prog << " --ob interface/raspberrypi2-native.cfg target/stm32g0x.cfg 200\n";
    std::cerr << "Example: " << prog << " --write-ob 0xDEFFE1AA\n";
    std::cerr << "Example: " << prog << " --cmp firmware.bin interface/raspberrypi2-native.cfg target/stm32g0x.cfg 0x08000000 200\n";
    std::cerr << "Example: " << prog << " --erase interface/raspberrypi2-native.cfg target/stm32g0x.cfg 200\n";
    std::cerr << "Example: " << prog << " --reset interface/raspberrypi2-native.cfg target/stm32g0x.cfg 200\n";
    std::cerr << "Example: " << prog << " --testInterface\n";
    std::cerr << "Example: " << prog << " --uart str \"49 50 A8\" /dev/ttyAMA1 9600 200\n";
	std::cerr << "Example: " << prog << " --uart file ./filePath /dev/ttyAMA1 9600 200\n";
}

bool ParseHex(const std::string& text, uint32_t& value) {
    char* end = nullptr;
    const unsigned long parsed = std::strtoul(text.c_str(), &end, 0);
    if (end == text.c_str() || *end != '\0') {
        return false;
    }
    value = static_cast<uint32_t>(parsed);
    return true;
}

std::string HexToAscii(const std::string& hexStr) {
    std::string ascii;
    std::string hex;
    
    for (char ch : hexStr) {
        if (ch != ' ' && ch != '\t' && ch != '\n' && ch != '\r') {
            hex += ch;
        }
        
        if (hex.length() == 2) {
            unsigned int byte;
            if (sscanf(hex.c_str(), "%2x", &byte) == 1) {
                if (byte >= 32 && byte <= 126) {
                    ascii += static_cast<char>(byte);
                } else {
                    ascii += '.';
                }
            }
            hex.clear();
        }
    }
    
    return ascii;
}
} // namespace

int STM32G030F6_Class::Flash_Func(int argc, char* argv[]){
	if (argc < 2) {
        PrintUsage(argv[0]);
        return 2;
    }

    if (std::string(argv[1]) == "--ob") {
        if (argc == 2) {
            //STM32G030F6_Class stm32;
            const bool ok = ReadAll_ob();
            return ok ? 0 : 1;
        }
        if (argc < 5) {
            PrintUsage(argv[0]);
            return 2;
        }
        const std::string interfaceCfg = argv[2];
        const std::string targetCfg = argv[3];
        const int adapterKhz = std::atoi(argv[4]);
        if (adapterKhz <= 0) {
            std::cerr << "Invalid adapter_khz: " << argv[4] << "\n";
            return 2;
        }
        interfaceCfg_ = interfaceCfg;
        targetCfg_ = targetCfg;
        adapterKhz_ = adapterKhz;
        const bool ok = ReadAll_ob();
        return ok ? 0 : 1;
    }

    if (std::string(argv[1]) == "--write-ob") {
        if (argc < 3) {
            PrintUsage(argv[0]);
            return 2;
        }
        
        uint32_t optrValue = 0;
        if (!ParseHex(argv[2], optrValue)) {
            std::cerr << "Invalid OPTR value: " << argv[2] << "\n";
            return 2;
        }

        if (argc == 3) {
            //STM32G030F6_Class stm32;
            const bool ok = WriteOptionBytes(optrValue);
            return ok ? 0 : 1;
        }
        
        if (argc < 6) {
            PrintUsage(argv[0]);
            return 2;
        }
        
