sasan-safaei/ICA_TM_V2/TM_V2/Source/STM32ProgFunc/STM32G030Class.cpp
        const std::string interfaceCfg = argv[3];
        const std::string targetCfg = argv[4];
        const int adapterKhz = std::atoi(argv[5]);
        if (adapterKhz <= 0) {
            std::cerr << "Invalid adapter_khz: " << argv[5] << "\n";
            return 2;
        }
        
        interfaceCfg_ = interfaceCfg;
        targetCfg_ = targetCfg;
        adapterKhz_ = adapterKhz;
        const bool ok = WriteOptionBytes(optrValue);
        return ok ? 0 : 1;
    }

    if (std::string(argv[1]) == "--cmp") {
        if (argc == 3) {
            //STM32G030F6_Class stm32;
            const FlashCompareResult res = Verify(argv[2]);
            if (res == FlashCompareResult::Empty) {
                std::cout << "Flash is empty" << std::endl;
                return 2;
            }
            if (res == FlashCompareResult::Same) {
                std::cout << "Flash matches firmware" << std::endl;
                return 4;
            }
            if (res == FlashCompareResult::Different) {
                std::cout << "Flash programmed with different firmware" << std::endl;
                return 3;
            }
            std::cerr << "Flash compare failed" << std::endl;
            return 1;
        }
        if (argc < 7) {
            PrintUsage(argv[0]);
            return 1;
        }

        const std::string binPath = argv[2];
        const std::string interfaceCfg = argv[3];
        const std::string targetCfg = argv[4];

        uint32_t address = 0;
        if (!ParseHex(argv[5], address)) {
            std::cerr << "Invalid address: " << argv[5] << "\n";
            return 1;
        }

        const int adapterKhz = std::atoi(argv[6]);
        if (adapterKhz <= 0) {
            std::cerr << "Invalid adapter_khz: " << argv[6] << "\n";
            return 1;
        }
        interfaceCfg_ = interfaceCfg;
        targetCfg_ = targetCfg;
        flashAddress_ = address;
        adapterKhz_ = adapterKhz;
        const FlashCompareResult res = Verify(binPath);
        if (res == FlashCompareResult::Empty) {
            std::cout << "Flash is empty" << std::endl;
            return 2;
        }
        if (res == FlashCompareResult::Same) {
            std::cout << "Flash matches firmware" << std::endl;
            return 4;
        }
        if (res == FlashCompareResult::Different) {
            std::cout << "Flash programmed with different firmware" << std::endl;
            return 3;
        }
        std::cerr << "Flash compare failed" << std::endl;
        return 1;
    }

    if (std::string(argv[1]) == "--erase") {
        if (argc == 2) {
            //STM32G030F6_Class stm32;
            const bool ok = Clear();
            return ok ? 0 : 1;
        }
        if (argc < 5) {
            PrintUsage(argv[0]);
            return 2;
        }

        const std::string interfaceCfg = argv[2];
        const std::string targetCfg = argv[3];
        const int adapterKhz = std::atoi(argv[4]);
        if (adapterKhz <= 0) {
            std::cerr << "Invalid adapter_khz: " << argv[4] << "\n";
            return 2;
        }
        interfaceCfg_ = interfaceCfg;
        targetCfg_ = targetCfg;
        adapterKhz_ = adapterKhz;
        const bool ok = Clear();
        return ok ? 0 : 1;
    }

    if (std::string(argv[1]) == "--reset") {
        if (argc == 2) {
            //STM32G030F6_Class stm32;
            const bool ok = Reset();
            return ok ? 0 : 1;
        }
        if (argc < 5) {
            PrintUsage(argv[0]);
            return 2;
        }

        const std::string interfaceCfg = argv[2];
        const std::string targetCfg = argv[3];
        const int adapterKhz = std::atoi(argv[4]);
        if (adapterKhz <= 0) {
            std::cerr << "Invalid adapter_khz: " << argv[4] << "\n";
            return 2;
        }

        interfaceCfg_ = interfaceCfg;
        targetCfg_ = targetCfg;
        adapterKhz_ = adapterKhz;
        const bool ok = Reset();
        return ok ? 0 : 1;
    }

    if (std::string(argv[1]) == "--testInterface") {
        if (argc == 2) {
            const bool ok = TestInterface();
            return ok ? 0 : 1;
        }
        if (argc < 5) {
            PrintUsage(argv[0]);
            return 2;
        }

        const std::string interfaceCfg = argv[2];
        const std::string targetCfg = argv[3];
        const int adapterKhz = std::atoi(argv[4]);
        if (adapterKhz <= 0) {
            std::cerr << "Invalid adapter_khz: " << argv[4] << "\n";
            return 2;
        }

        interfaceCfg_ = interfaceCfg;
        targetCfg_ = targetCfg;
        adapterKhz_ = adapterKhz;
        const bool ok = TestInterface();
        return ok ? 0 : 1;
    }

    if (std::string(argv[1]) == "--uart") {
        if (argc < 4) {
            PrintUsage(argv[0]);
            return 2;
        }		
		std::string hexStream = argv[3];
		if (std::string(argv[2]) == "file") {
			std::ifstream ifs(argv[3]);
			if (!ifs) {
				std::cerr << "Failed to open hex stream file: " << argv[3] << "\n";
				return 2;
			}
			std::ostringstream oss;
			oss << ifs.rdbuf();
			hexStream = oss.str();
		}
        std::string port = "/dev/ttyAMA1";
        int baud = 9600;
        int idleMs = 200;

        if (argc >= 5) {
            port = argv[4];
        }
        if (argc >= 6) {
            baud = std::atoi(argv[5]);
            if (baud <= 0) {
                std::cerr << "Invalid baud: " << argv[5] << "\n";
                return 2;
            }
        }
        if (argc >= 7) {
            idleMs = std::atoi(argv[6]);
            if (idleMs <= 0) {
                std::cerr << "Invalid idle_ms: " << argv[6] << "\n";
                return 2;
            }
        }

        //STM32G030F6_Class stm32("interface/raspberrypi2-native.cfg", "target/stm32g0x.cfg", 0x08000000, 200, port, baud);
		uartPort_ = port;
		uartBaud_ = baud;
        std::string responseHex;
        const bool ok = FrameProcess(hexStream, responseHex, idleMs);
        if (!ok) {
            return 1;
        }
        std::cout << responseHex << std::endl;
        std::cout << HexToAscii(responseHex) << std::endl;
        return 0;
    }

    const std::string binPath = argv[1];
    if (argc == 2) {
        //STM32G030F6_Class stm32;
        const bool ok = Flash(binPath);
        return ok ? 0 : 1;
    }

    if (argc < 6) {
        PrintUsage(argv[0]);
        return 2;
    }

    const std::string interfaceCfg = argv[2];
    const std::string targetCfg = argv[3];

    uint32_t address = 0;
    if (!ParseHex(argv[4], address)) {
        std::cerr << "Invalid address: " << argv[4] << "\n";
        return 2;
    }

    const int adapterKhz = std::atoi(argv[5]);
    if (adapterKhz <= 0) {
        std::cerr << "Invalid adapter_khz: " << argv[5] << "\n";
        return 2;
    }
    interfaceCfg_ = interfaceCfg;
    targetCfg_ = targetCfg;
    flashAddress_ = address;
    adapterKhz_ = adapterKhz;
    const bool ok = Flash(binPath);
    return ok ? 0 : 1;
}
int STM32G030F6_Class::Flash_Func(std::initializer_list<const char*> args) {
    std::vector<const char*> argv_vec;
    argv_vec.push_back("ica2506_flash");  // Program name as argv[0]
    argv_vec.insert(argv_vec.end(), args.begin(), args.end());
    return Flash_Func(static_cast<int>(argv_vec.size()), 
                      const_cast<char**>(argv_vec.data()));
}
